performance.yml
config:
  target: "https://api.todoist.com/rest/v1"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
  defaults:
   headers:
     Authorization: Bearer {{ $processEnvironment.TOKEN }}
     Content-type: application/json  
scenarios:
  - flow:
    #Get active tasks 
      - get:
          url: "/tasks"
    #Create task 
      - post:
          url: "/tasks"
          json:
           content: "Test"
          capture:
           json: "$.id"
           as: "taskID"
      - log: "current ID is {{taskID}}"
    #Get active task 
      - get:
          url: "/tasks/{{taskID}}"
    #Update task
      - post:
          url: "/tasks/{{taskID}}"
          json:
           content: "Test-Edit"
    #Check task
      - post:
          url: "/tasks/{{taskID}}/close"
    #Reopen task
      - post:
          url: "/tasks/{{taskID}}/reopen" 
    #Delete task 
      - delete:
          url: "/tasks/{{taskID}}"