performance.yml
config:
  target: "https://api.todoist.com/rest/v1"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
  defaults:
   headers:
     Authorization: Bearer {{ $processEnvironment.TOKEN }}
     Content-type: application/json  
scenarios:
  - flow:
      - get:
          url: "/task"
      - post:
          url: "/tasks"
          json:
           content: "Test"
          capture:
           json: "$.id"
           as: "taskID"
      - log: "current ID is {{taskID}}"
      - get:
          url: "/task/{{taskID}}"
      - post:
          url: "/tasks/{{taskID}}"
          json:
           content: "Test-Edit"
      - post:
          url: "/tasks/{{taskID}}/close"
      - post:
          url: "/tasks/{{taskID}}/reopen" 
      - delete:
          url: "/task/{{taskID}}"